Repository: ESUCC/Maximd
Catalog: application/translation/form004/page5.tmx
Source language: es
Languages: en

source: Transición
en: Transition

source: Desmarcar el cuadro de la izquierda para disolver el Plan de Transición
en: Uncheck the box to the left to dissolve the Transition Plan

source: Este estudiante tiene o cumplirá 16 años de edad durante este IEP. Se requiere un plan de transición
en: This student is or will turn 16 during this IEP. Transition plan is required

source: Este estudiante no cumplirá 16 años durante este IEP, por lo que no se requiere una declaración de los servicios de transición del niño. Marcar aquí para establecer un plan de transición
en: This student will not turn 16 during this IEP, so a statement of the child's transition services is not required. Check here to set up a transition plan

source: No se ha diseñado ningún plan de transición para este estudiante
en: No Transition Plan has been designed for this Student

source: Complete todos los que apliquen, de lo contrario explique por qué este ítem no aplica
en: Complete all that apply, otherwise explain why this item does not apply

source: Objetivos medibles después de la secundaria (preparatoria) basados en evaluaciones de transición apropiadas según la edad : (Esta sección DEBE incluir educación/capacitación, empleo, y cuando sea apropiado, objetivos para vivir independientemente.)
en: Measurable post-secondary goals based on age appropriate transition assessments: (This section MUST include education/training, employment, and when appropriate independent living goals.)

source: Curso de estudio
en: Course of Study

source: Se requiere una declaración de los servicios de transición necesarios comenzando a más tardar con el primer IEP que esté en vigencia cuando el niño cumpla 16 años de edad, o antes, si el equipo del IEP determina que es conveniente
en: Beginning no later than the first IEP to be in effect when the child turns 16, or younger if determined appropriate by the IEP team, a statement of needed transition services is required

source: indicar las fortalezas y/o las necesidades para cada área y de ser apropiado, una declaración sobre las responsabilidades entre las agencias y cualquier otra colaboración necesaria
en: indicate the strengths and/or needs for each area and when appropriate, statement of interagency responsibilities or any needed linkages

source: Instrucción
en: Instruction

source: Servicios relacionados
en: Related Services

source: Experiencias comunitarias
en: Community Experiences

source: Desarrollo laboral y de otros objetivos post-escolares de vida adulta apropiados
en: Development of employment and other appropriate post school adult living objectives

source: ej: feria de trabajo, evaluación vocacional, observación de trabajos, experiencia laboral, habilidades de búsqueda y mantenimiento laboral , visitas a universidades/programas de capacitación
en: i.e. career fair, vocational evaluation, job shadowing, work experience, job seeking and keeping skills, visit college/training programs

source: Habilidades de la vida cotidiana
en: Daily Living Skills

source: Evaluación vocacional funcional
en: Functional Vocational Evaluation

source: Asociaciones y responsabilidades entre agencias
en: Interagency Linkages and Responsibilities

source: Actividades de transición
en: Transition Activities

source: Agencia responsable
en: Agency Responsible

source: Fecha de vencimiento
en: Date Due

source: Objetivos después de la secundaria (preparatoria)
en: Post Secondary Goals

source: El (Los) objetivo (s) anteriores incluyen educación/capacitación, empleo, y de ser apropiado, objetivos para vivir independientemente:
en: The above goal(s) include education/training, employment, and when appropriate independent living goals.:

source: (Ej. Transporte para actividades comunitarias, capacitación laboral, tecnología asistiva, ayuda para participar en actividades comunitarias, incluyendo la planeación de las necesidades relacionadas al periodo después de la escuela)
en: (i.e. transportation for community activities, job coaching, assistive technology, assistance to participate in community activities, include planning for related post-school needs)

source: (Ej. Ocio, actividades de socialización y recreativas , acceso a transporte, trabajo voluntario y responsabilidad civil)
en: (i.e. leisure, recreation and socialization activities, accessing transportation, volunteer work and civic responsibilities)

source: (Ej: Aseo, preparación de comidas, manejo del dinero, lavandería, mantenimiento residencial)
en: (i.e. grooming, meal preparation, money management, laundry, maintaining residence)

source: (Ej. Proceso de evaluación para identificar intereses, habilidades y necesidades, por lo general, a través de la evaluación/observación de situaciones)
en: (i.e. assessment process to identify interests, skills, and needs, usually through situational assessment/observation)
